In [16]:
# Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

import pandas as pd 
import numpy as np
from env import host, username, password

def get_db_url(host, username, password, database):
    url = f'mysql+pymysql://{username}:{password}@{host}/{database}'
    return url

In [47]:
# Use your function to obtain a connection to the employees database.

url = get_db_url(host, username, password, 'employees')

In [39]:
# Once you have successfully run a query:


pd.read_sql('SELECT * FROM employees', url)

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [191]:
get_db_url(host, username, password, 'titles')
pd.read_sql('Select * from titles', url)

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [41]:
sql = '''
SELECT
    emp_no,
    first_name,
    last_name
FROM employees
WHERE gender = 'F'
LIMIT 100
'''

employees = pd.read_sql(sql, url)
employees.head()

   emp_no first_name  last_name
0   10002    Bezalel     Simmel
1   10006     Anneke    Preusig
2   10007    Tzvetan  Zielinski
3   10009     Sumant       Peac
4   10010  Duangkaew   Piveteau

In [42]:
# Read the employees and titles tables into two separate DataFrames.

titles_df = pd.read_sql('SELECT * FROM titles', url)

# Display the summary statistics for each DataFrame.

titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [43]:
# Read the employees and titles tables into two separate DataFrames.

employees_df = pd.read_sql('SELECT * FROM employees', url)

# Display the summary statistics for each DataFrame.

employees_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [44]:
# How many rows and columns do you have in each DataFrame? Is that what you expected?

titles_df.shape

(443308, 4)

In [45]:
# How many rows and columns do you have in each DataFrame? Is that what you expected?

employees_df.shape

(300024, 6)

In [51]:
# How many unique titles are in the titles DataFrame

pd.read_sql('SELECT DISTINCT title FROM titles', url).count()

title    7
dtype: int64

In [53]:
# What is the oldest date in the to_date column?

pd.read_sql('select min(to_date) from titles', url)

  min(to_date)
0   1985-03-01

In [70]:
# What is the most recent date in the to_date column?
to_date_df = pd.read_sql('select to_date from titles', url)

to_date_df['to_date'].sort_values(key=lambda to_date: to_date < 'now', ascending=False)

TypeError: '<' not supported between instances of 'datetime.date' and 'str'